           TESTSUITE 'Batch Testsuite'

           TESTCASE 'Reading a line leads to sensible values'
           MOVE "4711112345678900005000000Testüberweisung"
               TO TRANSACTION
           EXPECT BANKID TO BE 47111
           EXPECT ACCOUNTID TO BE 1234567890
           EXPECT AMOUNT TO BE 00050000.00
           EXPECT COMMENT TO BE "Testüberweisung".

           TESTCASE 'Closing a bank resets both bank and account'
           INITIALIZE CURRENTBANK CURRENTACCOUNT
           MOVE 47112 TO CURRENTBANK
           MOVE 1111111111 TO CURRENTACCOUNT
           PERFORM CLOSE-BANK
           EXPECT CBID TO BE 00000
           EXPECT CAID TO BE 0000000000.

           TESTCASE 'Closing an account leaves bank intact'
           INITIALIZE CURRENTBANK CURRENTACCOUNT
           MOVE 47112 TO CURRENTBANK
           MOVE 1111111111 TO CURRENTACCOUNT
           PERFORM CLOSE-ACCOUNT
           EXPECT CBID TO BE 47112
           EXPECT CAID TO BE 0000000000.

           TESTCASE 'Processing with a different bank/acc resets amount'
           INITIALIZE CURRENTBANK CURRENTACCOUNT
           MOVE 47112 TO CURRENTBANK
           MOVE 1111111111 TO CURRENTACCOUNT
           MOVE 10000 TO AMOUNT
           MOVE "4711112345678900005000000Testüberweisung"
               TO TRANSACTION
           PERFORM PROCESS-TRANSACTION
           EXPECT AMOUNT TO BE 00050000.00.

           TESTCASE 'Processing identical bank/acc accumulates amount'
           INITIALIZE CURRENTBANK CURRENTACCOUNT
           MOVE 47112 TO CURRENTBANK
           MOVE 1111111111 TO CURRENTACCOUNT
           MOVE 10000 TO CBSALDO
           MOVE 10000 TO CASALDO
           MOVE "4711211111111110005000000Testüberweisung"
               TO TRANSACTION
           PERFORM PROCESS-TRANSACTION
           EXPECT CBSALDO TO BE 00060000.00
           EXPECT CASALDO TO BE 00060000.00.

           TESTCASE 'Processing identical bank but different acc'
           INITIALIZE CURRENTBANK CURRENTACCOUNT
           MOVE 47112 TO CURRENTBANK
           MOVE 1111111112 TO CURRENTACCOUNT
           MOVE 10000 TO CBSALDO
           MOVE 10000 TO CASALDO
           MOVE "4711211111111110005000000Testüberweisung"
               TO TRANSACTION
           PERFORM PROCESS-TRANSACTION
           EXPECT CBSALDO TO BE 00060000.00
           EXPECT CASALDO TO BE 00050000.00.
