       IDENTIFICATION DIVISION.
       PROGRAM-ID.  HOLDEM_M.
      *****************************************************************
      * Implementierung des Holdem Spiels.
      *****************************************************************       
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORLD'
           STOP RUN.