       01  TAG-MATRIX.
         05  TAG-MROW OCCURS 50.
           07  TAG-MCELL OCCURS 50 PIC X.
             88  TAG-ALIVE VALUE "O".
             88  TAG-DEAD  VALUE SPACE.
